app/controllers/api/routes_controller.rb

  def index
    @maps = Map.all
---
SELECT `maps`.* FROM `maps`