app/views/api/routes/index.json.jbuilder

SELECT `maps`.* FROM `maps`
---
json.mapas @maps.each do |map|