app/views/welcome/_place.html.erb

  <%= hidden_field_tag :map, @map.id %>
  <% if @map.places.present? %>
---
SELECT `places`.* FROM `places` WHERE `places`.`map_id` = 11