app/views/welcome/index.html.erb

            <td><%= map.name %></td>
            <td><%= map.routes.size %></td>
---
SELECT COUNT(*) FROM `routes` WHERE `routes`.`map_id` = 9