app/controllers/welcome_controller.rb

SELECT `maps`.* FROM `maps`
---
  def index
    @maps = Map.all

SELECT  `maps`.* FROM `maps` WHERE `maps`.`name` = 'Rio de Janeiro' LIMIT 1
INSERT INTO `maps` (`name`, `created_at`, `updated_at`) VALUES ('Rio', '2015-07-10 16:16:26', '2015-07-10 16:16:26')
INSERT INTO `routes` (`origin`, `destination`, `distance`, `map_id`, `created_at`, `updated_at`) VALUES ('A', 'B', 10, 10, '2015-07-10 16:16:26', '2015-07-10 16:16:26')
INSERT INTO `places` (`name`, `map_id`, `created_at`, `updated_at`) VALUES ('a', 11, '2015-07-10 17:07:54', '2015-07-10 17:07:54')
SELECT  `places`.* FROM `places` WHERE `places`.`map_id` = 11 AND `places`.`name` = 'a' LIMIT 1
---
  def create_route
     map = Map.find_or_initialize_by(name: params[:map])
     map.routes.build routes_params
     map.save!
     map.places.create(name: params[:origin]) unless map.places.find_by(name: params[:origin])

SELECT `maps`.* FROM `maps`
---
  def route
    @maps = Map.all

SELECT  `maps`.* FROM `maps` WHERE `maps`.`id` = NULL LIMIT 1
---
  def places
    @map = Map.find(params[:map])

SELECT  `maps`.* FROM `maps` WHERE `maps`.`id` = 12 LIMIT 1
SELECT  `routes`.* FROM `routes` WHERE `routes`.`map_id` = 12 AND (origin = 'A' and destination = 'C' || destination = 'A' and origin = 'C')  ORDER BY `routes`.`id` ASC LIMIT 1
---
  def route_show
    res = Map.find(params[:map]).routes.where("origin = ? and destination = ? || destination = ? and origin = ?", params[:origin], params[:destination] , params[:origin], params[:destination] ).first